{
    "users": [],
    "programs": [
      {
        "name": "Mucuna Loan Program",
        "description": "Founded on the principles of technology and product innovation, Angaza is collaborating with the Kenya Industrial Research and Development Institute (KIRDI) and supported by Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH to develop commercial products from the Mucuna pruriens bean. This initiative aims to create sustainable markets for Mucuna bean farmers while leveraging the crop’s significant soil improvement benefits. By establishing strong market demand, the program enhances farmer incomes and promotes soil quality, contributing to long-term agricultural sustainability and environmental resilience.",
        "location": "Nairobi",
        "startDate": "2025-01-01",
        "endDate": "2025-12-31"
      },
        {
        "name": "Avocado Program",
        "description": "Angaza Consultants is transforming avocado farming in Western Kenya by creating sustainable market access for farmers. In 2024, we distributed 4,000 Hass avocado seedlings and plan to sell 20,000+ seedlings in 2025. To support value addition, we are investing in an avocado oil processing facility. This initiative will boost farmer incomes, job creation, and agro-industrial growth. Additionally, byproducts will be converted into organic fertilizer and black soldier fly larvae for animal feed, promoting sustainability. Through training, partnerships, and agribusiness linkages, Angaza aims to establish Western Kenya as a leading avocado production hub.",
        "location": "Nairobi",
        "startDate": "2025-01-01",
        "endDate": "2025-12-31"
      },
        {
        "name": "Soya Program",
        "description": "In partnership with the Youth in Sustainable Aquaculture (YISA) program, led by Farm Africa, Angaza is engaging youth in soybean contract farming. This five-year program, running from 2024 to 2029, targets six counties: Kilifi, Kakamega, Busia, Siaya, Kisumu, and Homabay. The soybeans produced are directed to fish feed manufacturers with the aim of improving the quality of locally manufactured feeds while reducing the feeding cost for fish in the lake region of Kenya. This initiative not only enhances profitability for fish farmers but also promotes sustainability across the aquaculture value chain, creating long-term economic and environmental benefits.",
        "location": "Nairobi",
        "startDate": "2025-01-01",
        "endDate": "2025-12-31"
      }
      
    ]
  }
  